thesis.org
#+TITLE: Reinforcement Learning Portfolio Optimization of Electric Vehicle Virtual Power Plants
#+AUTHOR:Tobias Richter

# Formatting
#+LATEX_CLASS_OPTIONS: [12pt, article]
#+LATEX_HEADER: \usepackage[a4paper, left=5cm,right=2cm,top=2cm,bottom=2cm]{geometry}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \usepackage{caption}
#+LATEX_HEADER: \onehalfspacing
#+OPTIONS: H:4

# Typography
#+LATEX_HEADER: \usepackage[official]{eurosym}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{amssymb}


# Bibliography
#+LATEX_HEADER: \usepackage[backend=biber, style=apa]{biblatex}
#+LATEX_HEADER: \addbibresource{~/uni/ma-thesis/bibliography/references.bib}

# Title & TOC
#+OPTIONS: title:nil toc:nil
#+LATEX_HEADER: \usepackage[numbib,notlof,notlot,nottoc]{tocbibind}
#+LATEX_HEADER: \pagenumbering{Roman}

#+INCLUDE: "~/uni/ma-thesis/titlepage.tex" export latex
#+LATEX: \setcounter{page}{2}

#+LATEX: \tableofcontents
#+LATEX: \clearpage
#+LATEX: \pagenumbering{arabic}

* Introduction (10%)
** Research Motivation
- cite:lopes11_integ_elect_vehic_elect_power_system
# It is also expected that the amount of intermittent RES
# that can be safely integrated into the electric power system
# may increase due to EV storage capacity [11]. Given the
# uncontrollability of these energy sources, since they only
# produce energy when the primary renewable resource is
# available, EV capability to store energy and inject it later
# into the system will avoid spillage of clean energy,
# resulting in the decreased usage of the conventional fossil
# fuel units and expensive generators during peak hours.
** Research Question
** Relevance

#+LATEX: \clearpage
* Related Literature (10%)
