thesis.org
** Reinforcement Learning in Smart Grids

Previous research showed that intelligent agents equipped with Reinforcement
Learning methods can successfully take action in the smart grid.
textcite:reddy11_strat,reddy11_learn_behav_multip_auton_agent conducted
research, in which autonomous broker agents parencite:ketter13_power_tac learn
their strategies using RL. textcite:peters13_reinf_learn_approac_to_auton build
on that work and further enhance the method, by learning over larger state
spaces to accommodate arbitrary economic signals. This method is especially
beneficial in smart markets because the markets structures might change in the
future and intelligent agents should adapt to a variety of market structures and
conditions.

parencite:vazquez-canteli19_reinf_learn_deman_respon


textcite:valogianni14_effec_manag_elect_vehic_storag adopt RL methods to learn
electricity consumption behavior of households. The authors implement these
methods in intelligent agents to smart charge EVs more effectively.
textcite:vandael15_reinf_learn_heuris_ev_fleet use RL to learn collective EV
fleet charging behavior to profitably purchase electricity on the day-ahead
market. We consider RL a perfect fit for the design of our proposed intelligent
agent, especially as a solution for our Research Question 2. When dynamically
optimizing the VPP portfolio composition of the fleet, there is no historical
data available to train a model. Using RL and a reward function that maximizes
the overall profitability of the fleet, the agent can learn from its environment
with unknown dynamics and take a certain set of actions. The agent can consider
different states (e.g., current and forecasted rental demand levels and
electricity prices) to take actions (e.g., allocate battery capacity to different
types of VPPs) that maximizes the reward function.

* Theoretical Background (10%)
** Electricity Markets
*** Balancing Market
# parencite:brandt17_evaluat_busin_model_vehic_grid_integ has a good section
# explaining the markets.
*** Spot Market
** Reinforcement Learning
*** Notation
# NOTE: State set for every single quantity used.
The input to the network $x \in \mathbb{R}^D$ is fed to the first residual layer to get the activation $y = x + \sigma(w x + b) \in \mathbb{R}^D$ with $w \in \mathbb{R}^{D \times D}$, and $b \in \mathbb{R}^D$ the weights and bias of the layer.
*** Markow Decision Processes
*** Q-Learning
*** Function Approximation
*** Exploitation-Exploration Tradeoff
*** Deep Reinforcement Learning
* Empirical Setting / Data (10%)
** Carsharing Fleets of Electric Vehicles
# Car2Go FourTwo assumptions:
# https://www.mobilityhouse.com/de_de/elektroautos/smart/smart-eq-fortwo.html#smart-eq-fortwo-ladeinformationen


# - 17.6 Kwh battery capacity
# - 140km reach with fully charged battery

# - 3.3 (!) KW Charging capacity
# - 6h to fully charge at 4.6KW (Non-linear charging)
# - Introduced 2012, 450, later 50 more (see wiki)
# - Third Gen Smart ForTwo electric
*** Raw Data
The dataset consists of 500 EVs in Stuttgart. As displayed in Table
ref:car2go-sample-data, the data contain spatio-temporal attributes, such as
timestamp, coordinates, and address of the EVs. Additionally, status attributes
of the interior and exterior are given, the relative state of charge and
information whether the EV is plugged into one of the 200 charging stations in
Stuttgart.

#+CAPTION: Raw Car2Go Trip Data from Stuttgart label:car2go-sample-data
#+ATTR_LATEX: :environment longtable :align l|ccccc
|--------------+----------+-----------+---------------------+----------+-----------------|
|--------------+----------+-----------+---------------------+----------+-----------------|
| Number Plate | Latitude | Longitude | Street              | Zip Code | Engine Type     |
|--------------+----------+-----------+---------------------+----------+-----------------|
| S-GO2471     | 9.19121  | 48.68895  | Parkplatz Flughafen | 70692    | electric        |
| S-GO2471     | 9.15922  | 48.78848  | Salzmannweg 3       | 70192    | electric        |
| S-GO2471     | 9.17496  | 48.74928  | Felix-Dahn-Str.45   | 70597    | electric        |
| S-GO2471     | 9.17496  | 48.74928  | Felix-Dahn-Str.45   | 70597    | electric        |
| S-GO2471     | 9.17496  | 48.74928  | Felix-Dahn-Str.45   | 70597    | electric        |
|--------------+----------+-----------+---------------------+----------+-----------------|
| Number Plate | Interior | Exterior  | Timestamp           | Charging | State of Charge |
|--------------+----------+-----------+---------------------+----------+-----------------|
| S-GO2471     | good     | good      | 22.12.2017 20:10    | no       | 94              |
| S-GO2471     | good     | good      | 24.12.2017 23:05    | no       | 72              |
| S-GO2471     | good     | good      | 26.12.2017 00:40    | yes      | 81              |
| S-GO2471     | good     | good      | 26.12.2017 00:45    | yes      | 83              |
| S-GO2471     | good     | good      | 26.12.2017 00:50    | yes      | 84              |
|--------------+----------+-----------+---------------------+----------+-----------------|
|--------------+----------+-----------+---------------------+----------+-----------------|
*** Preprocessing Steps
** Electricity Markets Data
*** Secondary Operating Reserve Market
# - Relax 1 MW minimum bidding assumption
#   - 500kw
#   - 100kw
*** Intraday Continuous Spot Market

* Model: FleetRL (20%)
** Information Assumptions
# See: parencite:mashhour11_biddin_strat_virtual_power_plant_1
** Mobility Demand & Clearing Price Prediction
** Reinforcement Learning Approach
** Bidding Strategy

* Evaluation (30%)
** Event-based Simulation
** Benchmark: Ad-hoc Strategies
# - Decision Tree like models
# - Metric: Peak-to-average (PAR) ratio reduction.
** FleetRL
** Sensitivity Analysis: Prediction Accuracy
** Sensitivity Analysis: Infrastructure Changes
** Sensitivity Analysis: Bidding Strategy
* Discussion (5%)
** Generalizability
** Future Electricity Landscape
** Limitations
# - See parencite:vazquez-canteli19_reinf_learn_deman_respon conclusion for
#   limitations in RL.
* Conclusion (5%)
** Contribution
# TODO: Compare to most simular studies.
# parencite:kahlen18_elect_vehic_virtual_power_plant_dilem,vandael15_reinf_learn_heuris_ev_fleet etc..
** Future Research



#+LATEX: \clearpage
#+LATEX: \printbibliography
* Footnotes

[fn:1] citetitle:energiewende2010, cite:energiewende2010.

[fn:2] https://www.car2go.com

[fn:3] https://www.epexspot.com

[fn:4] https://www.regelleistungen.net

[fn:5] NEG-NT = Negative secondary control reserve to be provided between 00:00h and 08:00h and between 20:00h and 24:00h.

POS-HT = Positive secondary control reserve to be provided between the hours of 08:00h and 20:00h.

[fn:6] Capacity prices are in given in
#+LATEX: \euro{}/MW.

[fn:7] Energy prices are in given in
#+LATEX: \euro{}/MWh.

[fn:8] Capacities are given in MW.

[fn:9] https://procom-energy.de/

[fn:10] Unit prices are given in
#+LATEX: \euro{}c/MWh.

[fn:11] Quantities are given in kW.

[fn:12] Products: are: H = Hourly, Q = Quarterly and B = Block.

