thesis.tex


\subsection{Reinforcement Learning in Smart Grids}
\label{sec:orgaba83b6}

Previous research showed that intelligent agents equipped with Reinforcement
Learning methods can successfully take action in the smart grid.
\textcite{reddy11_strat,reddy11_learn_behav_multip_auton_agent} conducted
research, in which autonomous broker agents \parencite{ketter13_power_tac} learn
their strategies using RL. \textcite{peters13_reinf_learn_approac_to_auton} build
on that work and further enhance the method, by learning over larger state
spaces to accommodate arbitrary economic signals. This method is especially
beneficial in smart markets because the markets structures might change in the
future and intelligent agents should adapt to a variety of market structures and
conditions.

\parencite{vazquez-canteli19_reinf_learn_deman_respon}


\textcite{valogianni14_effec_manag_elect_vehic_storag} adopt RL methods to learn
electricity consumption behavior of households. The authors implement these
methods in intelligent agents to smart charge EVs more effectively.
\textcite{vandael15_reinf_learn_heuris_ev_fleet} use RL to learn collective EV
fleet charging behavior to profitably purchase electricity on the day-ahead
market. We consider RL a perfect fit for the design of our proposed intelligent
agent, especially as a solution for our Research Question 2. When dynamically
optimizing the VPP portfolio composition of the fleet, there is no historical
data available to train a model. Using RL and a reward function that maximizes
the overall profitability of the fleet, the agent can learn from its environment
with unknown dynamics and take a certain set of actions. The agent can consider
different states (e.g., current and forecasted rental demand levels and
electricity prices) to take actions (e.g., allocate battery capacity to different
types of VPPs) that maximizes the reward function.

\section{Theoretical Background (10\%)}
\label{sec:org3e97b6e}
\subsection{Electricity Markets}
\label{sec:orgdb9f096}
\subsubsection{Balancing Market}
\label{sec:org3cfadee}
\subsubsection{Spot Market}
\label{sec:org671295b}
\subsection{Reinforcement Learning}
\label{sec:orgbcc6760}
\subsubsection{Notation}
\label{sec:orgba570cf}
The input to the network \(x \in \mathbb{R}^D\) is fed to the first residual layer to get the activation \(y = x + \sigma(w x + b) \in \mathbb{R}^D\) with \(w \in \mathbb{R}^{D \times D}\), and \(b \in \mathbb{R}^D\) the weights and bias of the layer.
\subsubsection{Markow Decision Processes}
\label{sec:org611ec57}
\subsubsection{Q-Learning}
\label{sec:org350514c}
\subsubsection{Function Approximation}
\label{sec:org0d4dbee}
\subsubsection{Exploitation-Exploration Tradeoff}
\label{sec:orge662874}
\subsubsection{Deep Reinforcement Learning}
\label{sec:org1e01a6c}
\section{Empirical Setting / Data (10\%)}
\label{sec:orgfe604a9}
\subsection{Carsharing Fleets of Electric Vehicles}
\label{sec:orga84902c}
\subsubsection{Raw Data}
\label{sec:orgad0d57a}
The dataset consists of 500 EVs in Stuttgart. As displayed in Table
\ref{car2go-sample-data}, the data contain spatio-temporal attributes, such as
timestamp, coordinates, and address of the EVs. Additionally, status attributes
of the interior and exterior are given, the relative state of charge and
information whether the EV is plugged into one of the 200 charging stations in
Stuttgart.

\begin{longtable}{l|ccccc}
\caption{Raw Car2Go Trip Data from Stuttgart \label{car2go-sample-data}}
\\
\hline
\hline
Number Plate & Latitude & Longitude & Street & Zip Code & Engine Type\\
\hline
\endfirsthead
\multicolumn{6}{l}{Continued from previous page} \\
\hline

Number Plate & Latitude & Longitude & Street & Zip Code & Engine Type \\

\hline
\endhead
\hline\multicolumn{6}{r}{Continued on next page} \\
\endfoot
\endlastfoot
\hline
S-GO2471 & 9.19121 & 48.68895 & Parkplatz Flughafen & 70692 & electric\\
S-GO2471 & 9.15922 & 48.78848 & Salzmannweg 3 & 70192 & electric\\
S-GO2471 & 9.17496 & 48.74928 & Felix-Dahn-Str.45 & 70597 & electric\\
S-GO2471 & 9.17496 & 48.74928 & Felix-Dahn-Str.45 & 70597 & electric\\
S-GO2471 & 9.17496 & 48.74928 & Felix-Dahn-Str.45 & 70597 & electric\\
\hline
Number Plate & Interior & Exterior & Timestamp & Charging & State of Charge\\
\hline
S-GO2471 & good & good & 22.12.2017 20:10 & no & 94\\
S-GO2471 & good & good & 24.12.2017 23:05 & no & 72\\
S-GO2471 & good & good & 26.12.2017 00:40 & yes & 81\\
S-GO2471 & good & good & 26.12.2017 00:45 & yes & 83\\
S-GO2471 & good & good & 26.12.2017 00:50 & yes & 84\\
\hline
\hline
\end{longtable}
\subsubsection{Preprocessing Steps}
\label{sec:org0c4c2ec}
\subsection{Electricity Markets Data}
\label{sec:org64e0541}
\subsubsection{Secondary Operating Reserve Market}
\label{sec:org2d0f431}
\subsubsection{Intraday Continuous Spot Market}
\label{sec:org3e0f31a}

\section{Model: FleetRL (20\%)}
\label{sec:orgfe40104}
\subsection{Information Assumptions}
\label{sec:orgc5c61d5}
\subsection{Mobility Demand \& Clearing Price Prediction}
\label{sec:org927ab91}
\subsection{Reinforcement Learning Approach}
\label{sec:org990ad74}
\subsection{Bidding Strategy}
\label{sec:orga13282c}

\section{Evaluation (30\%)}
\label{sec:org6129e08}
\subsection{Event-based Simulation}
\label{sec:org7b8a7e2}
\subsection{Benchmark: Ad-hoc Strategies}
\label{sec:org31e7863}
\subsection{FleetRL}
\label{sec:orgcb91c41}
\subsection{Sensitivity Analysis: Prediction Accuracy}
\label{sec:orgbf2f71e}
\subsection{Sensitivity Analysis: Infrastructure Changes}
\label{sec:org7e425ad}
\subsection{Sensitivity Analysis: Bidding Strategy}
\label{sec:org7aaae9b}
\section{Discussion (5\%)}
\label{sec:org4366c67}
\subsection{Generalizability}
\label{sec:orga4daa72}
\subsection{Future Electricity Landscape}
\label{sec:org5c66e1c}
\subsection{Limitations}
\label{sec:org5e1c957}
\section{Conclusion (5\%)}
\label{sec:org36d9e0a}
\subsection{Contribution}
\label{sec:org275ee1c}
\subsection{Future Research}
\label{sec:org9bb4df2}



\clearpage
\printbibliography
\end{document}
